scripts/load-test/smoke.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 5
      arrivalRate: 2
      name: "Smoke"
  processor: "./processor.js"

scenarios:
  - name: "Charge then read"
    flow:
      - post:
          url: "/api/v1/payments/charge"
          beforeRequest: "signCharge"
          capture:
            - json: "$.paymentId"
              as: "paymentId"
      - get:
          url: "/api/v1/payments/{{ paymentId }}"
          beforeRequest: "addAuthHeader"